app/controllers/blacklists_controller.rb

SELECT "blacklists".* FROM "blacklists"
SELECT "topics".* FROM "topics"
---
  def index
    @blacklists = Blacklist.all
    @topics = Topic.all

INSERT INTO "blacklists" ("word", "created_at", "updated_at") VALUES (?, ?, ?)  [["word", "Primeira palavra"], ["created_at", "2019-07-29 11:12:44.838053"], ["updated_at", "2019-07-29 11:12:44.838053"]]
---
  def create
    @blacklist = Blacklist.new(blacklist_params)
    if @blacklist.save

SELECT  "blacklists".* FROM "blacklists" WHERE "blacklists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @blacklist = Blacklist.find(params[:id])

UPDATE "blacklists" SET "word" = ?, "updated_at" = ? WHERE "blacklists"."id" = ?  [["word", "Primeira Palavra"], ["updated_at", "2019-07-29 11:38:11.007791"], ["id", 1]]
---
  def update
    if @blacklist.update(blacklist_params)

SELECT  "blacklists".* FROM "blacklists" WHERE "blacklists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_blacklist
    @blacklist = Blacklist.find(params[:id])