app/controllers/descriptions_controller.rb

INSERT INTO "descriptions" ("desc", "created_at", "updated_at", "topic_id") VALUES (?, ?, ?, ?)  [["desc", "Resposta Primeiro Teste"], ["created_at", "2019-07-25 00:58:17.842530"], ["updated_at", "2019-07-25 00:58:17.842530"], ["topic_id", 1]]
---
  def create
    @description = Description.new(description_params)
    @description.topic_id = params[:topic_id]
    if @description.save