app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)
    if @topic.save
---
INSERT INTO "topics" ("created_at", "updated_at", "title") VALUES (?, ?, ?)  [["created_at", "2019-07-24 23:40:26.332329"], ["updated_at", "2019-07-24 23:40:26.332329"], ["title", "Primeiro Teste"]]

  def show
    @topic = Topic.find(params[:id])
    @descriptions = Description.where(topic: @topic)
    @blacklists = Blacklist.all
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "descriptions".* FROM "descriptions" WHERE "descriptions"."topic_id" = ?  [["topic_id", 1]]
SELECT "blacklists".* FROM "blacklists"